tutorials/combustion/fireFoam/LES/compartmentFire/system/panelRegion/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 20;

method          structured;

structuredCoeffs
{
    method      simple;
    patches     (region0_to_panelRegion_wallPanel region0_to_panelRegion_internalWallPanel_top region0_to_panelRegion_internalWallPanel_bottom);

    simpleCoeffs
    {
         n               ( 5 1 4 );
         delta           0.001;
    }
}


hierarchicalCoeffs
{
    n               ( 1 2 2 );
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}

metisCoeffs
{
}


// ************************************************************************* //
